; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	image7 - mode
	infrared1 - mode
	thermograph0 - mode
	image2 - mode
	image4 - mode
	thermograph6 - mode
	image5 - mode
	thermograph3 - mode
	infrared8 - mode
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared8)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image7)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image2)
	(supports instrument2 thermograph6)
	(supports instrument2 image5)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image7)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared1)
	(supports instrument5 infrared8)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument6 image2)
	(supports instrument6 infrared1)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star1)
	(supports instrument7 thermograph3)
	(supports instrument7 image5)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star0)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star6)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument9 image7)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Star0)
	(have_image Phenomenon7 thermograph3)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon7 infrared8)
	(have_image Planet8 image7)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon9 image4)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 thermograph0)
	(have_image Planet10 image7)
	(have_image Planet10 infrared8)
	(have_image Star11 image2)
	(have_image Star11 thermograph6)
	(have_image Star11 infrared8)
))

)

; plan
1. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 16
2. (calibrate satellite3 instrument9 groundstation3)
   added: (calibrated instrument9)
   goals met: 0 of 16
3. (turn_to satellite3 planet10 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet10)
   goals met: 0 of 16
4. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 16
5. (calibrate satellite2 instrument7 groundstation5)
   added: (calibrated instrument7)
   goals met: 0 of 16
6. (turn_to satellite2 phenomenon7 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 phenomenon7)
   goals met: 0 of 16
7. (take_image satellite2 phenomenon7 instrument7 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 1 of 16
8. (turn_to satellite2 groundstation3 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 16
9. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 16
10. (take_image satellite3 planet10 instrument9 image7)
   added: (have_image planet10 image7)
   goals met: 2 of 16
11. (switch_off instrument7 satellite2)
   deleted: (power_on instrument7)
   added: (power_avail satellite2)
   goals met: 2 of 16
12. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 16
13. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 16
14. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 16
15. (calibrate satellite2 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 2 of 16
16. (calibrate satellite1 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 2 of 16
17. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 16
18. (turn_to satellite0 star11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star11)
   goals met: 2 of 16
19. (take_image satellite0 star11 instrument2 image2)
   added: (have_image star11 image2)
   goals met: 3 of 16
20. (take_image satellite0 star11 instrument2 thermograph6)
   added: (have_image star11 thermograph6)
   goals met: 4 of 16
21. (turn_to satellite1 phenomenon7 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 16
22. (take_image satellite1 phenomenon7 instrument5 infrared8)
   added: (have_image phenomenon7 infrared8)
   goals met: 5 of 16
23. (turn_to satellite1 planet10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet10)
   goals met: 5 of 16
24. (take_image satellite1 planet10 instrument5 infrared8)
   added: (have_image planet10 infrared8)
   goals met: 6 of 16
25. (turn_to satellite1 star11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star11)
   goals met: 6 of 16
26. (take_image satellite1 star11 instrument5 infrared8)
   added: (have_image star11 infrared8)
   goals met: 7 of 16
27. (turn_to satellite1 star1 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star1)
   goals met: 8 of 16
28. (turn_to satellite2 phenomenon9 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon9)
   goals met: 8 of 16
29. (take_image satellite2 phenomenon9 instrument6 image2)
   added: (have_image phenomenon9 image2)
   goals met: 9 of 16
30. (take_image satellite2 phenomenon9 instrument6 image4)
   added: (have_image phenomenon9 image4)
   goals met: 10 of 16
31. (take_image satellite2 phenomenon9 instrument6 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 11 of 16
32. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 11 of 16
33. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 11 of 16
34. (turn_to satellite2 groundstation4 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation4)
   goals met: 12 of 16
35. (calibrate satellite2 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 12 of 16
36. (turn_to satellite2 phenomenon7 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon7)
   goals met: 11 of 16
37. (take_image satellite2 phenomenon7 instrument8 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 12 of 16
38. (turn_to satellite2 planet10 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet10)
   goals met: 12 of 16
39. (take_image satellite2 planet10 instrument8 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 13 of 16
40. (turn_to satellite2 groundstation4 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation4)
   goals met: 14 of 16
41. (turn_to satellite3 planet8 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet8)
   goals met: 14 of 16
42. (take_image satellite3 planet8 instrument9 image7)
   added: (have_image planet8 image7)
   goals met: 15 of 16
43. (turn_to satellite3 star0 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star0)
   goals met: 16 of 16
